---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetProperties.Get(System.Int32)
source: html/dcdee945-b819-c9da-22ea-4ef5f0b06065.htm
---
# Autodesk.Revit.DB.Visual.AssetProperties.Get Method

Gets the property at the given index.

## Syntax (C#)
```csharp
public AssetProperty Get(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - An integer index.

## Returns
The property at the given index.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - index is out of range.